{
  "nav": {
    "home": "الرئيسية",
    "services": "خدماتنا",
    "about": "من نحن",
    "partners": "شركاؤنا",
    "contact": "تواصل معنا"
  },
  "services": {
    "title": "خدماتنا",
    "items": {
      "application-security": {
        "title": "أمن التطبيقات",
        "desc": "حماية تطبيقاتك من نقاط الضعف والتهديدات السيبرانية بحلول أمنية متقدمة.",
        "longDesc": "توفر خدمة أمن التطبيقات لدينا حماية شاملة لتطبيقات أعمالك. نقوم بتنفيذ طبقات متعددة من الضوابط الأمنية، وإجراء تقييمات أمنية منتظمة، ودمج أفضل ممارسات الأمان طوال دورة حياة التطوير لضمان بقاء تطبيقاتك آمنة ضد التهديدات السيبرانية المتطورة."
      },
      "black-box-testing": {
        "title": "اختبار الصندوق الأسود",
        "desc": "محاكاة الهجمات الواقعية لتحديد وإصلاح نقاط الضعف الأمنية في أنظمتك.",
        "longDesc": "تقوم خدمة اختبار الصندوق الأسود لدينا بمحاكاة هجمات إلكترونية واقعية لتحديد نقاط الضعف في أنظمتك. باستخدام منهجيات اختبار متقدمة، نقوم بتقييم موقفك الأمني من منظور المهاجم وتقديم إرشادات تفصيلية للمعالجة."
      },
      "cloud-security": {
        "title": "أمن السحابة",
        "desc": "تأمين البنية التحتية السحابية والبيانات من خلال خدمات أمنية شاملة.",
        "longDesc": "تضمن حلول الأمن السحابي لدينا حماية البنية التحتية السحابية عبر جميع المنصات الرئيسية. نقوم بتنفيذ ضوابط أمنية قوية، ومراقبة التهديدات، والحفاظ على الامتثال لمعايير الصناعة للبيئات السحابية."
      },
      "dlp": {
        "title": "منع تسرب البيانات",
        "desc": "منع الوصول غير المصرح به وتسرب البيانات التجارية الحساسة.",
        "longDesc": "تساعد خدمة منع تسرب البيانات لدينا المؤسسات في حماية البيانات الحساسة من الفقدان والتسرب والوصول غير المصرح به. نقوم بتنفيذ سياسات وتقنيات شاملة لمراقبة واكتشاف ومنع خروقات البيانات عبر جميع أنظمتك وشبكاتك."
      }
    }
  }
,

  "about": {
    "title": "عن إتقان",
    "subtitle": "شركة سعودية رائدة في مجال الأمن السيبراني متخصصة في تقديم خدمات عالية الجودة للجهات الحكومية والشركات",
    "intro": "نحن متخصصون في تقديم حلول مخصصة لحماية البيانات الحساسة والحفاظ على المصالح الوطنية في العصر الرقمي الحالي. يستخدم فريقنا من الخبراء أحدث التقنيات لضمان أمن العملاء، بما في ذلك اكتشاف التهديدات وإدارة المخاطر والامتثال",
    "mission": {
      "title": "مهمتنا",
      "content": "في ظل المشهد الرقمي المتزايد التعقيد، تتمثل مهمة إتقان في تعزيز مرونة المؤسسات وتأمين الأصول الحيوية ضد التهديدات السيبرانية المتطورة. نتبع نهجًا شاملاً، يدمج أطر الحوكمة والمخاطر والامتثال، وتقييمات الأمان، والدعم التشغيلي لحماية الحدود الرقمية لعملائنا"
    },
    "vision": {
      "title": "رؤيتنا",
      "content": "في إتقان، نسعى لنكون الشريك الموثوق به في مجال الأمن السيبراني في المملكة العربية السعودية، حيث نحمي المؤسسات عبر مختلف القطاعات من خلال الحلول المبتكرة والرؤى الخبيرة والالتزام بالتميز"
    },
    "services": {
      "title": "خدماتنا وخبراتنا",
      "grc": "الحوكمة والمخاطر والامتثال",
      "enterprise": "هندسة المؤسسات",
      "security": "تقييم الأمن",
      "soc": "خدمات مركز العمليات الأمنية"
    },
    "stats": {
      "team": "فريق من الخبراء",
      "partners": "شركاء موثوقون",
      "certifications": "شهادات معتمدة",
      "innovation": "ابتكار"
    }
  },
  "contact": {
    "title": "تواصل معنا",
    "subtitle": "نحن هنا للإجابة على استفساراتك ومساعدتك في تحقيق رؤيتك",
    "meta": {
      "title": "تواصل مع إتقان | خبراء الأمن السيبراني",
      "description": "احمِ أعمالك مع حلول إتقان الرائدة في الأمن السيبراني. تواصل معنا لتأمين أصولك الرقمية وضمان سلامة مؤسستك."
    },
    "form": {
      "sending": "جاري الإرسال...",
      "title": "تواصل معنا",
      "name": "الاسم",
      "email": "البريد الإلكتروني",
      "phone": "رقم الهاتف",
      "message": "الرسالة",
      "submit": "إرسال الرسالة",
      "success": "تم إرسال رسالتك بنجاح. سنتواصل معك قريباً!",
      "error": "فشل في إرسال الرسالة. يرجى المحاولة مرة أخرى."
    },
    "info": {
      "title": "معلومات التواصل",
      "address": {
        "label": "العنوان",
        "value": "الرياض، المملكة العربية السعودية"
      },
      "phone": {
        "label": "الهاتف",
        "value": "+966 XX XXX XXXX"
      },
      "email": {
        "label": "البريد الإلكتروني",
        "value": "info@etqaa.com"
      },
      "hours": {
        "label": "ساعات العمل",
        "value": "الأحد - الخميس: ٩:٠٠ ص - ٥:٠٠ م"
      }
    }
  }

}